ConnectTest/src/Enums/СтатусыСообщений/СтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщений</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>НеОтправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлено</name>
  </enumValues>
  <enumValues>
    <name>Прочитано</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/CommonModules/ИнтеграцияСSmsGold/Module.bsl
//SC-069610
Функция ОтправитьСМС(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.Сервер, Параметры.Порт, Параметры.Пользователь, Параметры.Пароль,, Параметры.Таймаут, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.ИспользоватьАутентификациюОС);	
	
	URL = "http2"+
		"?user="   + Параметры.Пользователь +
		"&pass="   + Параметры.Пароль +
		"&number=" + Параметры.НомерТелефона +
		"&sender=" + Параметры.ИмяОтправителя +
		"&text="   + Параметры.Текст;
	
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	Попытка
		Ответ.Вставить("ИД", ТелоЗапроса);
		Ответ.Вставить("СтатусСообщения", Перечисления.СтатусыСообщений.Отправлено);		
	Исключение
		Ответ.Вставить("Ошибка", ТелоЗапроса);		
	КонецПопытки;
	
	Ответ.Вставить("Период", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;	
	
КонецФункции

Функция ПроверитьСтатусСМС(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.Сервер, Параметры.Порт, Параметры.Пользователь, Параметры.Пароль,, Параметры.Таймаут, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.ИспользоватьАутентификациюОС);	
	
	URL = "http2"+
		"?user="   + Параметры.Пользователь +
		"&pass="   + Параметры.Пароль +
		"&smsid="  + Параметры.ИД;
	
	ЗапросHTTP	= Новый HTTPЗапрос(URL);	
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ОтветСтатус	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	Статус	= СтатусСообщения(ОтветСтатус);
	
	Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.СтатусыСообщений") Тогда
		Ответ.Вставить("СтатусСообщения", Статус);
	Иначе
		Ответ.Вставить("СтатусСообщения", Перечисления.СтатусыСообщений.НеДоставлено);
		Ответ.Вставить("Ошибка","Неизвестный статус");
	КонецЕсли;
	
	Ответ.Вставить("Период", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;
	
КонецФункции

Функция СтатусСообщения(Статус)
	
	Если Статус = "ENROUTE" Или Статус = "ACCEPTD" Тогда
		Возврат Перечисления.СтатусыСообщений.Отправлено;
	ИначеЕсли Статус = "DELETED" Или Статус = "REJECTD" Тогда
		Возврат Перечисления.СтатусыСообщений.НеОтправлено;
	ИначеЕсли Статус = "DELIVRD" Тогда
		Возврат Перечисления.СтатусыСообщений.Доставлено;
	ИначеЕсли Статус = "EXPIRED" Или Статус = "UNDELIV" Или Статус = "UNKNOWN" Тогда
		Возврат Перечисления.СтатусыСообщений.НеДоставлено;
	Иначе
		Возврат Статус;
	КонецЕсли;

КонецФункции
